# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import pandas as pd
import numpy as np
import re

import warnings
warnings.filterwarnings('ignore')

Next, import `Orders` from Ironhack's database into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# your code here

orders=pd.read_csv('..\\your-code\\Orders.csv')
pd.set_option('display.max_columns', None)
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [10]:
# your code here
def firstel(x):
    
    return x.iloc[0]

cust_spent= orders.groupby('CustomerID').agg({'amount_spent': 'sum',
                                              'Country': firstel})

cust_spent

            amount_spent         Country
CustomerID
12346           77183.60  United Kingdom
12347            4310.00         Iceland
12348            1797.24         Finland
12349            1757.55           Italy
12350             334.40          Norway
...                  ...             ...
18280             180.60  United Kingdom
18281              80.82  United Kingdom
18282             178.05  United Kingdom
18283            2094.88  United Kingdom
18287            1837.28  United Kingdom

[4339 rows x 2 columns]

In [6]:
c = cust_spent.sort_values('amount_spent',ascending=False)

c

            amount_spent         Country
CustomerID
14646          280206.02     Netherlands
18102          259657.30  United Kingdom
17450          194550.79  United Kingdom
16446          168472.50  United Kingdom
14911          143825.06            EIRE
...                  ...             ...
17956              12.75  United Kingdom
16454               6.90  United Kingdom
14792               6.20  United Kingdom
16738               3.75  United Kingdom
13256               0.00  United Kingdom

[4339 rows x 2 columns]

In [7]:
p75 =cust_spent['amount_spent'].quantile(0.75)
p95 =cust_spent['amount_spent'].quantile(0.95)

preferred_costumers = cust_spent[cust_spent['amount_spent'].between(p75,p95)]

preferred_costumers

            amount_spent         Country
CustomerID
12347            4310.00         Iceland
12348            1797.24         Finland
12349            1757.55           Italy
12352            2506.04          Norway
12356            2811.43        Portugal
...                  ...             ...
18259            2338.60  United Kingdom
18260            2643.20  United Kingdom
18272            3078.58  United Kingdom
18283            2094.88  United Kingdom
18287            1837.28  United Kingdom

[868 rows x 2 columns]

In [8]:
VIP_costumers = cust_spent[cust_spent['amount_spent']>=p95]

VIP_costumers

            amount_spent         Country
CustomerID
12346           77183.60  United Kingdom
12357            6207.67     Switzerland
12359            6372.58          Cyprus
12409           11072.67     Switzerland
12415          124914.53       Australia
...                  ...             ...
18109            8052.97  United Kingdom
18139            8438.34  United Kingdom
18172            7561.68  United Kingdom
18223            6484.54  United Kingdom
18229            7276.90  United Kingdom

[217 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [9]:
VIP_costumers['Country'].value_counts()

United Kingdom     177
Germany             10
France               9
Switzerland          3
Australia            2
Spain                2
Japan                2
Portugal             2
EIRE                 2
Finland              1
Norway               1
Denmark              1
Cyprus               1
Singapore            1
Netherlands          1
Channel Islands      1
Sweden               1
Name: Country, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [14]:
VIP_costumers['Country'].value_counts()

United Kingdom     177
Germany             10
France               9
Switzerland          3
Australia            2
Spain                2
Japan                2
Portugal             2
EIRE                 2
Finland              1
Norway               1
Denmark              1
Cyprus               1
Singapore            1
Netherlands          1
Channel Islands      1
Sweden               1
Name: Country, dtype: int64

In [15]:
 preferred_costumers['Country'].value_counts()

United Kingdom     755
Germany             29
France              20
Belgium             11
Norway               6
Switzerland          6
Spain                5
Italy                5
Portugal             5
Finland              4
Channel Islands      3
Japan                2
Israel               2
Australia            2
Denmark              2
Cyprus               2
EIRE                 1
Canada               1
Greece               1
Iceland              1
Poland               1
Lebanon              1
Sweden               1
Austria              1
Malta                1
Name: Country, dtype: int64

In [23]:
 suma_customers = preferred_costumers['Country'].value_counts() + VIP_costumers['Country'].value_counts()

In [24]:
 suma_customers

Australia            4.0
Austria              NaN
Belgium              NaN
Canada               NaN
Channel Islands      4.0
Cyprus               3.0
Denmark              3.0
EIRE                 3.0
Finland              5.0
France              29.0
Germany             39.0
Greece               NaN
Iceland              NaN
Israel               NaN
Italy                NaN
Japan                4.0
Lebanon              NaN
Malta                NaN
Netherlands          NaN
Norway               7.0
Poland               NaN
Portugal             7.0
Singapore            NaN
Spain                7.0
Sweden               2.0
Switzerland          9.0
United Kingdom     932.0
Name: Country, dtype: float64

In [25]:
type(suma_customers)

pandas.core.series.Series

In [27]:
ordenada = suma_customers.sort_values(ascending=False)

ordenada

United Kingdom     932.0
Germany             39.0
France              29.0
Switzerland          9.0
Norway               7.0
Portugal             7.0
Spain                7.0
Finland              5.0
Australia            4.0
Channel Islands      4.0
Japan                4.0
Cyprus               3.0
Denmark              3.0
EIRE                 3.0
Sweden               2.0
Austria              NaN
Belgium              NaN
Canada               NaN
Greece               NaN
Iceland              NaN
Israel               NaN
Italy                NaN
Lebanon              NaN
Malta                NaN
Netherlands          NaN
Poland               NaN
Singapore            NaN
Name: Country, dtype: float64